app/controllers/surveys_controller.rb

	def thank
        @fcm = ($global_fcm * 100).round(2)
        @fcr = ($global_fcr * 100).round(2)
        @fa = ($global_fa * 100).round(2)

        @user_type = $global_user_type

        if (@user_type == 'user')
            @result = Survey.where("user_type = 'user'")
        elsif (@user_type == 'developer')
            @result = Survey.where("user_type = 'developer'")
        end

        fcm_sum = 0.0
        fcr_sum = 0.0
        fa_sum = 0.0

        for x in 0..(@result.size-1)
---
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."user_type" = ? LIMIT ?  [["user_type", "user"], ["LIMIT", 1]]
SELECT  "surveys".* FROM "surveys" WHERE (user_type == 'user') LIMIT ?  [["LIMIT", 11]]
SELECT COUNT(*) FROM "surveys" WHERE (user_type == 'developer')

	def create
		@survey=Survey.new(survey_params)

   		if @survey.save
---
INSERT INTO "surveys" ("name", "user_type", "created_at", "updated_at", "fr", "fp", "fo", "fs", "fc", "fm", "ft", "rp", "ro", "rs", "rc", "rm", "rt", "po", "ps", "pc", "pm", "pt", "os", "oc", "om", "ot", "sc", "sm", "st", "cm", "ct", "mt", "f_weight", "r_weight", "p_weight", "o_weight", "s_weight", "c_weight", "m_weight", "t_weight") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)


            $global_user_type = @survey.user_type

            @survey.save
---
UPDATE "surveys" SET "updated_at" = ?, "fr" = ?, "fp" = ?, "fo" = ?, "fs" = ?, "fc" = ?, "fm" = ?, "ft" = ?, "rp" = ?, "ro" = ?, "rs" = ?, "rc" = ?, "rm" = ?, "rt" = ?, "po" = ?, "ps" = ?, "pc" = ?, "pm" = ?, "pt" = ?, "os" = ?, "oc" = ?, "om" = ?, "ot" = ?, "sc" = ?, "sm" = ?, "st" = ?, "cm" = ?, "ct" = ?, "mt" = ?, "f_weight" = ?, "r_weight" = ?, "p_weight" = ?, "o_weight" = ?, "s_weight" = ?, "c_weight" = ?, "m_weight" = ?, "t_weight" = ? WHERE "surveys"."id" = ?